Revit 2026 API
IndexStreamLine Methods
The IndexStreamLine type exposes the following members.
Methods
Name | Description
AddLine |  Inserts a IndexLine segment into the stream and associated buffer.
AddLines
Dispose
(Inherited from IndexStream)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
IndexStreamLine Class
Autodesk.Revit.DB.DirectContext3D Namespace